In [418]:
import pandas as pd

df = pd.read_csv('data_sf.xls')
df.tail()

,Unnamed: 0,Name,Age,Nationality,Club,Value,Wage,Position,Crossing,Finishing,...,Penalties,Composure,Marking,StandingTackle,SlidingTackle,GKDiving,GKHandling,GKKicking,GKPositioning,GKReflexes
12892,13121,J. Lundstram,19,England,Crewe Alexandra,1100000,1000,CM,34,38,...,43,45,40,48,47,10,13,7,8,9
12893,13122,N. Christoffersson,19,Sweden,Trelleborgs FF,60000,1000,ST,23,52,...,43,42,22,15,19,10,9,9,5,12
12894,13123,B. Worman,16,England,Cambridge United,60000,1000,ST,25,40,...,55,41,32,13,11,6,5,10,6,13
12895,13124,D. Walker-Rice,17,England,Tranmere Rovers,60000,1000,RW,44,50,...,50,46,20,25,27,14,6,14,8,9
12896,13125,G. Nugent,16,England,Tranmere Rovers,60000,1000,CM,41,34,...,33,43,40,43,50,10,15,9,12,9

In [23]:
club_list = df['Club'].value_counts()
top_clubs = club_list[club_list == club_list.max()]
bottom_club = club_list[club_list == club_list[-1]]
bottom_club

Atlético Mineiro    6
Name: Club, dtype: int64

In [40]:
pos = df['Position'].value_counts(normalize=True)
pos.loc[pos > 0.1].index

Index(['GK', 'ST', 'CB'], dtype='object')

In [44]:
pos = df['Position'].value_counts(normalize=True)
pos.loc[pos < 0.01]

LS     0.009382
RS     0.008839
RWB    0.005428
LWB    0.004652
CF     0.003954
LF     0.000620
RF     0.000465
LAM    0.000465
RAM    0.000388
Name: Position, dtype: float64

In [65]:
small_df = df[df.columns[0:7]].head(25)
w = small_df.Wage.value_counts(bins=4)
w.index
w.index[3].left
w.index[1].right
small_df['Wage'] > w.index[3].left
small_df.loc[small_df['Wage'] > w.index[3].left]

   Unnamed: 0       Name  Age Nationality          Club      Value    Wage
0           0   L. Messi   31   Argentina  FC Barcelona  110500000  565000
7           7  L. Suárez   31     Uruguay  FC Barcelona   80000000  455000

## Задания

In [76]:
df['FKAccuracy'].value_counts(bins=5)

(21.2, 39.4]     4859
(39.4, 57.6]     3957
(57.6, 75.8]     2108
(2.908, 21.2]    1760
(75.8, 94.0]      213
Name: FKAccuracy, dtype: int64

In [88]:
s = small_df['Club'].value_counts()
s.index
s_df = s.reset_index()
s_df.columns = ['Club', 'Players Count']
display(s_df)

                  Club  Players Count
0          Real Madrid              4
1         FC Barcelona              4
2      Manchester City              3
3             Juventus              3
4      Atlético Madrid              3
5              Chelsea              2
6    FC Bayern München              2
7  Paris Saint-Germain              2
8    Tottenham Hotspur              1
9    Manchester United              1

In [99]:
spanish = df[df['Nationality'] == 'Spain']['Wage']
spanish.value_counts(normalize=True, bins=4)

(620.999, 95750.0]      0.970194
(95750.0, 190500.0]     0.016393
(190500.0, 285250.0]    0.008942
(285250.0, 380000.0]    0.004471
Name: Wage, dtype: float64

In [107]:
lads = df[df['Club'] == 'Manchester United']
lads['Nationality'].nunique()

13

In [199]:
# Alex Sandro, Douglas Costa
br1 = df[(df['Nationality'] == 'Brazil') & (df['Club'] == 'Juventus')]
br1.Name.unique()

array(['Alex Sandro', 'Douglas Costa'], dtype=object)

In [146]:
df[df['Age'] > 35].Club.value_counts()

Club Atlético Huracán             4
Hokkaido Consadole Sapporo        4
Gimnasia y Esgrima La Plata       3
Club Atlético Talleres            3
Hammarby IF                       3
                                 ..
Guangzhou Evergrande Taobao FC    1
Rayo Vallecano                    1
Colo-Colo                         1
FC Girondins de Bordeaux          1
IF Elfsborg                       1
Name: Club, Length: 212, dtype: int64

In [150]:
df[df['Nationality'] == 'Argentina']['Age'].value_counts(bins=4)

(22.25, 28.5]      200
(15.974, 22.25]    197
(28.5, 34.75]      128
(34.75, 41.0]       49
Name: Age, dtype: int64

In [156]:
df[df['Nationality'] == 'Spain']['Age'].value_counts(normalize=True)

21    0.117735
22    0.095380
20    0.077496
23    0.071535
25    0.064083
27    0.062593
24    0.059613
28    0.053651
26    0.053651
29    0.047690
19    0.047690
18    0.038748
30    0.038748
31    0.032787
32    0.032787
33    0.031297
34    0.022355
17    0.013413
35    0.011923
36    0.010432
37    0.008942
39    0.002981
16    0.002981
38    0.001490
Name: Age, dtype: float64

In [173]:
br2 = df.groupby(['Position'])['Wage'].sum()
br3 = br2.sort_values(ascending=False).reset_index()
br3[br3['Wage'] > 5000000]

  Position      Wage
0       ST  11873000
1       GK   8784000
2       CB   7476000
3       CM   6194000
4       LB   6096000
5      CAM   5500000
6       LM   5440000
7       RM   5098000
8       RB   5034000

In [200]:
df.groupby(['Position'])[['Wage','Value']].mean().sort_values(['Value'] ,ascending=False).loc['LF']

Wage        75125.0
Value    27362500.0
Name: LF, dtype: float64

In [222]:
mm = df.groupby(['Club'])['Wage'].agg(['mean', 'median'])
mnmn = mm.loc[mm['mean'] == mm['median']]

mnmn.sort_values(['mean'], ascending=False).iloc[0]

mean      13000.0
median    13000.0
Name: Cruzeiro, dtype: float64

In [224]:
df[df['Club'] == 'Chelsea']['Wage'].sum()

2035000

In [240]:
df[df['Nationality'] == 'Argentina'].groupby(['Age'])['Wage'].max().loc[[20, 30]]

Age
20     54000
30    300000
Name: Wage, dtype: int64

In [241]:
df[df['Nationality'] == 'Argentina'].groupby(['Age'])['Wage'].min().loc[30]

1000

In [242]:
df[(df['Club'] == 'FC Barcelona') & (df['Nationality'] == 'Argentina')][['Strength', 'Balance']].max()

Strength    59
Balance     95
dtype: int64

# Pivot Tables -- Сводные Таблицы

In [250]:
pivot = df.loc[
    df['Club']
    .isin(['FC Barcelona','Real Madrid','Juventus','Manchester United'])]\
    .pivot_table(values=['Wage'],
                index=['Nationality'],
                columns=['Club'],
                aggfunc='sum',
                margins=True,
                fill_value=0)
display(pivot)

                           Wage                                         \
Club               FC Barcelona Juventus Manchester United Real Madrid
Nationality
Argentina                565000   205000            206000           0
Belgium                  110000        0            230000      240000
Bosnia Herzegovina            0   180000                 0           0
Brazil                   465000   335000             91000      570000
Chile                    205000        0            215000           0
Costa Rica                    0        0                 0      195000
Croatia                  260000   160000                 0      420000
Dominican Republic            0        0                 0      140000
Ecuador                       0        0            120000           0
England                       0        0            478000           0
France                   495000   145000            375000      459000
Germany                  240000   160000                 0      355000
Italy                         0   460000             88000           0
Ivory Coast                   0        0            105000           0
Morocco                       0   160000                 0           0
Netherlands              135000        0                 0           0
Poland                        0   125000                 0           0
Portugal                 125000   405000                 0           0
Scotland                      0        0             11000           0
Serbia                        0        0            165000           0
Spain                    912000        0            260000     1404000
Uruguay                  455000        0                 0           0
Wales                         0        0             13000      355000
All                     3967000  2335000           2357000     4138000


Club                     All
Nationality
Argentina             976000
Belgium               580000
Bosnia Herzegovina    180000
Brazil               1461000
Chile                 420000
Costa Rica            195000
Croatia               840000
Dominican Republic    140000
Ecuador               120000
England               478000
France               1474000
Germany               755000
Italy                 548000
Ivory Coast           105000
Morocco               160000
Netherlands           135000
Poland                125000
Portugal              530000
Scotland               11000
Serbia                165000
Spain                2576000
Uruguay               455000
Wales                 368000
All                 12797000

In [260]:
pivot = df.loc[df['Club']
               .isin(['FC Barcelona','Real Madrid','Juventus','Manchester United'])]\
                .pivot_table(values=['Name'],

index=['Nationality'],
columns=['Club'],
aggfunc='count',
fill_value=0)
# display(pivot)
pivot.loc['Argentina']['Name']['Juventus']

1

In [303]:
pivot13 = df.pivot_table(values=['Name'], index=['Position'], columns=['Club'], aggfunc='count', fill_value=0)
# display(pivot13)
pivot13.loc['GK'].mean()

2.5246153846153847

In [302]:
pivot13.loc['CM'].value_counts(ascending=True)

6      5
5     21
4     39
3     89
0    136
2    149
1    211
Name: CM, dtype: int64

In [308]:
pivot14 = df.pivot_table(values=['Wage'], index=['Nationality'], columns=['Club'], aggfunc='sum', fill_value=0)
display(pivot14)
pivot14.loc['Russia']['Wage']['AS Monaco']

                            Wage                                             \
Club         SSV Jahn Regensburg 1. FC Heidenheim 1846 1. FC Kaiserslautern
Nationality
Afghanistan                    0                     0                    0
Albania                        0                     0                    0
Algeria                        0                     0                    0
Andorra                        0                     0                    0
Angola                         0                     0                    0
...                          ...                   ...                  ...
Uzbekistan                     0                     0                    0
Venezuela                      0                     0                    0
Wales                          0                     0                    0
Zambia                         0                     0                    0
Zimbabwe                       0                     0                    0

                                                                          \
Club        1. FC Köln 1. FC Magdeburg 1. FC Nürnberg 1. FC Union Berlin
Nationality
Afghanistan          0               0              0                  0
Albania              0               0              0                  0
Algeria              0               0              0                  0
Andorra              0               0              0                  0
Angola               0               0              0                  0
...                ...             ...            ...                ...
Uzbekistan           0               0              0                  0
Venezuela            0               0              0                  0
Wales                0               0              0                  0
Zambia               0               0              0                  0
Zimbabwe             0               0              0                  0

                                                   ...                    \
Club        1. FSV Mainz 05 AC Ajaccio AC Horsens  ... Wycombe Wanderers
Nationality                                        ...
Afghanistan               0          0          0  ...                 0
Albania                   0       2000          0  ...                 0
Algeria                   0          0          0  ...                 0
Andorra                   0          0          0  ...                 0
Angola                    0          0          0  ...                 0
...                     ...        ...        ...  ...               ...
Uzbekistan                0          0          0  ...                 0
Venezuela                 0          0          0  ...                 0
Wales                     0          0          0  ...              4000
Zambia                    0          0          0  ...                 0
Zimbabwe                  0          0          0  ...                 0

                                                                             \
Club        Yeni Malatyaspor Yeovil Town Yokohama F. Marinos Zagłębie Lubin
Nationality
Afghanistan                0           0                   0              0
Albania                    0           0                   0              0
Algeria                    0        1000                   0              0
Andorra                    0           0                   0              0
Angola                     0           0                   0              0
...                      ...         ...                 ...            ...
Uzbekistan                 0           0                   0              0
Venezuela                  0           0                   0              0
Wales                      0        2000                   0              0
Zambia                     0           0                   0              0
Zimbabwe                   0           0                   0              0

                                                                        \
Club        Zagłębie Sosnowiec Çaykur Rizespor Örebro SK Östersunds FK
Nationality
Afghanistan                  0               0         0             0
Albania                      0               0      1000             0
Algeria                      0               0         0             0
Andorra                      0               0         0             0
Angola                    1000               0         0             0
...                        ...             ...       ...           ...
Uzbekistan                   0               0         0             0
Venezuela                    0               0         0             0
Wales                        0               0         0             0
Zambia                       0               0         0             0
Zimbabwe                     0               0         0             0


Club        Śląsk Wrocław
Nationality
Afghanistan             0
Albania                 0
Algeria                 0
Andorra                 0
Angola                  0
...                   ...
Uzbekistan              0
Venezuela               0
Wales                   0
Zambia                  0
Zimbabwe                0

[156 rows x 650 columns]

61000

### 1st solution

In [434]:
pivot142 = df.groupby(['Position'])['SprintSpeed'].mean().sort_values(ascending=False)
display(pivot142.loc[['RB', 'LM', 'RM', 'CF', 'RS']].sort_values(ascending=False))

Position
RM    74.943864
LM    74.211538
RS    71.991228
RB    71.186709
CF    69.803922
Name: SprintSpeed, dtype: float64

### 2nd solution (using pivot tables)

In [432]:
pivot142a = df.pivot_table(values=['SprintSpeed'], index='Club', columns='Position', aggfunc='mean')
# убрал RWM, потому что нельзя передавать отсутсвующие в таблице индексы
pivot142a['SprintSpeed'][['RB', 'LM', 'RM', 'CF', 'RS']].mean().sort_values(ascending=False).head(3)

Position
RM    75.363112
LM    74.338201
RS    71.991228
dtype: float64

In [435]:
pivot142a = df.pivot_table(values=['SprintSpeed'], index='Club', columns='Position', aggfunc='mean')
pivot142a['SprintSpeed']['ST'].sort_values(ascending=False).head(3)

Club
Vitória      91.0
Sydney FC    88.0
CD Lugo      87.0
Name: ST, dtype: float64